[
	{
		"version": "0.43.00",
        "date": "October 17th, 2022",
        "content": [
            "Welcome to the Melee Madness update - Take the Whisk and try it now!",
            "Added the Melee Whisk for all players! Press F to melee or set a key in settings.",
            "The premium Blood Wings are available in the shop and free for all VIP members.",
            "Enjoy the community submitted stamps from our discord! Stamps from Thee_Owl, KJDCitsme, Artshocks, Tidy, Cook, Zamsgod and Sharkbucks   ",
            "Added more haunting Halloween hats to the store!",
            "Moved Blue, Road, Mud Gulch, Dirt and Sparta to the public map pool",
            "Moved Jailbreak, Space Factory, Shipyard, Scales, and Vert to the private map pool"
		]
	},
	{
		"version": "0.42.20",
        "date": "October 3rd, 2022",
        "content": [
            "Welcome to the Maniacal Mansion update! Enter if you DARE...",
            "The premium Bloodonade is available in the shop and free for all VIP members",
            "Added the Spooktacular new map, Mansion to the Public map pool",
			"Vaulted the Twitch Drops 3 and Algebruh items",
            "Teggtris and Enchanted have had some upgrades - Check them out!",
            "Moved Jinx, Haunted, Shellville, and Jailbreak to the public map pool",
            "Moved Blender, Sky Scratcher, Overcooked, Fort Flip, and Rats to the private map pool"
		]
	},
	{
		"version": "0.42.19",
        "date": "September 15, 2022",
        "content": [
            "It's time for Twitch Drops 3! <a target='_blank' title='here' href='https://shellshock.io/twitch/?utm_medium=referral&utm_campaign=changelog'>Link Twitch and Shell Shockers accounts</a> and watch to earn items!",
            "The premium Teggtris Wings are available in the shop and free for all VIP members",
            "Added a range of Community Stickers, Stamps and Hats to the shop!",
            "Added Official Content Creator skins for Kilzomatic and Sharkbucks - check the shop!",
            "The resplendant Valkyrie Free-Ranger has been added to the shop",
            "Moved Castle, Space Factory, Scales, Shipyard and Vert to the public map pool",
            "Moved Stage, Growler, Moonbase, Trainyard, and Wreckage to the private map pool"
		]
	},
	{
		"version": "0.42.18",
        "date": "August 31, 2022",
        "content": [
            "The Algebruh update is here - last year’s A+ skins with some eggscellent additions!",
            "Amazing sleuthing - the Scavenger Hunt was completed incredibly fast, and the 'X Marks the Spot' hat has been added to all inventories",
            "The brilliant Premium Rainbow Wings have been added to the store and are free for all VIP members!",
            "Clear your plate! Vaulted the Breakfast set",
            "Added the amazing new map Teggtris to the public map pool - drop into a game and try it now!",
			"Mobile improvements: added pinch to resize feature for mobile controls",
            "Moved Blender, Sky Scratcher, Cluckgrounds, and Stage to the public map pool",
            "Moved Kings Court, Wimble, Palace Siege, Feedlot, Blue, and Dirt 2 to the private map pool"
		]
	},
	{
		"version": "0.42.17",
		"date": "Aug 15th, 2022",
		"content": [
			"Look out! The Scavenger Hunt Update is here! We have hidden a <a id='changelog-link' target='_blank' title='Hidden items' href='#'>Statue, Coin, Emblem, Pebble and Wisp</a> in EVERY map in Shell Shockers. Find as many as you can and report them in our discord to unlock a special item in-store!",
			"Search the store - Eggcellent Scavenger items added to the store to inspire the search",
			"The Devestating Scavenger Crackshot has been added to the store as a premium item and free for all VIP members",
			"Buckawwk - Vaulted the Chicken set!",
			"KotC Changes - When a team is on 4/5 caps a video ad will not play on player death until there is a winner",
			"Moved Overcooked and Fort Flip to the public map pool",
			"Moved Catacombs, Shellville, Space Factory, Ruins, and Junction to the private map pool"
		]
	},
	{
		"version": "0.42.16",
		"date": "Aug 2nd, 2022",
		"content": [
			"Take a bite out of our latest update - The Breakfast set is served!",
			"Udder Devastation - The eggsclusive Milk Grenade has been lobbed into the store & is free for all VIP members",
			"New Kitchen map peices have been added to the game, including new Public and Private map, Rats!",
			"Moved Trainyard, King's Court, Growler, Wreckage, and Catacombs to the public map pool",
			"Moved Road, Castle, Mud Gulch, Dirt, and Scales to the private map pool"
		]
	},
	{
		"version": "0.42.15",
		"date": "July 15th, 2022",
		"content": [
			"A Plot Chickens! - The Chicken set has been re-released with some crunchy new additions",
			"Bawk and Roll - The eggsclusive Rubber Chicken CSG1 lands in the store & is free for all VIP members",
			"Holy Cluck - A new premium item has been added - The Valkyrie Grenade has ascended to the store",
			"What's that in the sky? Updated out of bounds areas on Dirt",
			"Moved Shellville, Space Factory, Two Towers, Moonbase, and Ruins to the public map pool",
			"Moved Sparta, Jailbreak, Sky Scratcher, Bastion, and Vert to the private map pool"
		]
	},
	{
		"version": "0.42.14",
		"date": "June 30th, 2022",
		"content": [
			"SPORTS hard, SPORTS often, SPORTS update now available! Check out the new items!",
			"Mobile improvements - Improvements to Scrambler, Free Ranger, Tri-hard & host of bug fixes",
			"You Madden Bro? The eggsclusive Helmet Grenade lands in the store & is free for all VIP members",
			"Added quick navigation to maps on the private game window - just press the first letter of the map you want!",
			"Added the new map Wimble to the public map pool",
			"Updated Death Pit KotC, Space Arena and Vert Layouts",
			"Moved Blue, Feedlot, Palace Siege, Road, and Junction to the public map pool",
			"Moved Blender, Overcooked, Growler, Cluckgrounds, and Shellville to the private map pool"
		]
	},
	{
		"version": "0.42.13",
		"date": "June 16th, 2022",
		"content": [
			"EGGPIRE STRIKES BACK - The second installment of eggwalker skins has arrived!",
			"Mobile improvements - Assorted minor bug fixes and translations",
			"Engage Hyperdrive! The eggsclusive Cross-Wing Fighter Hat has flown into the store and is free for all VIP members",
			"Added the Premium Valkyrie Scrambler to the item shop!",
			"Moved Dirt Too, Sparta, Jail Break, Castle, and Sky Scratcher to the public map pool",
			"Moved Four Quarters, Shipyard, Space Factory, Enchanted, Fort Flip and King's Court to the private map pool"
		]
	},
	{
		"version": "0.42.12",
		"date": "June 1st, 2022",
		"content": [
			"Sun's out, Guns out - It's time for some fun in the sun with new skins, maps and more!",
			"Mobile improvements - Toggle button look added to settings",
			"Mobile improvements - iOS graphic boost",
			"Mobile improvements - Added collapsible scoreboard and more!",
			"The eggciting Bumblebee Grenade has buzzed into the store and is free for all VIP members",
			"Vaulted the Dino Skin set",
			"The new summer map Vert has been added to the public map pool!",
			"Minor updates have been made to Kings Court, Bastion and Dirt",
			"Moved Mud Gulch, Bastion, Dirt, and Scales to the public map pool",
			"Moved Helix, Moonbase, Two Towers, Road, and Timetwist to the private map pool"
		]
		},
	{
		"version": "0.42.11",
		"date": "May 16th, 2022",
		"content": [
			"The Massive Mobile Update! Shell Shockers Mobile is better than ever! Including:",
			"Better autofire settings - never get caught out",
			"Smoother controls for grenades, reloads, jumps and more",
			"More customization - edit your sensitivity, control locations and more!",
			"Right now: X2 eggs for all players on mobile, stacks with VIP & Weekend bonus for X8 eggs",
			"The Mobile items are now in the shop - get em while you can!",
			"Download <a target='_blank' title='here on iOS' href='https://apps.apple.com/app/apple-store/id1515978119?pt=118229234&ct=ss-changelog&mt=8'>here on iOS</a> and <a target='_blank' title='here on Android' href='https://play.google.com/store/apps/details?id=com.bluewizard.shellshockers&referrer=utm_source=ss-changelog'>here on Android</a>!",
			"The Eggsclusive Airplane Wings are available in the store and free for all VIP members",
			"The Premium Valkyrie Eggk47 has been added for sale in the store!",
			"Vaulted the Basket Bros Skin set",
			"More maps are now rotated to public servers each update!",
			"Introducing New Dirt 1 and 2! Better gameplay AND FPS! ",
			"Moved Shipyard, Blender, Space Factory, Overcooked and Enchanted to the public map pool",
			"Moved Ruins, Sparta, Trainyard, Wreckage, and Catacombs to the private map pool"
			]
		},
		{
	   "version": "0.42.10",
	   "date": "May 2nd, 2022",
	   "content": [
		  "RAWR! The latest set of Dinosaur Skins have crashed into the store!",
		  "The Pterodactyl Wings are available in the store and free for all VIP members",
		  "Vaulted the Relic and Easter Skin sets",
		  "Introducing new map Growler to the public map pool and King of the Coop!",
		  "Moved Fort Flip, Cluckgrounds and Helix to the public map pool",
		  "Moved Blue, Jailbreak, Stage, Castle, Palace Siege and Feedlot to the private map pool"
	   ]
	},
	{
	   "version": "0.42.9",
	   "date": "April 14th, 2022",
	   "content": [
		  "Rejoice! EGG ORG has been defeated with the hidden code found on Timetwist!",
		  "Twitch Drops: Relics starts on the 15th! <a target='_blank' title='here' href='https://shellshock.io/twitch/?utm_medium=referral&utm_campaign=changelog'>Link Twitch and Shell Shockers accounts</a> to unlock EGG ORG Relics.",
		  "Redeem code '5831' in Shell Shockers to see how EGG ORG was defeated.",
		  "All eggs that survived EGG ORG recieve the Shattered EGG ORG crest!",
		  "The premium Retro AK is available in the shop and free for all VIP members",
		  "Added a range of Twitch emotes and Twitch items to the shop!",
		  "Vaulted the EGG ORG skins",
		  "This update features skins from creators: Graysocean, JWBerry3D and Polarized Moon!",
		  "Moved Two Towers, Kings Court and Road to the public map pool",
		  "Moved Scales, Enchanted, and Sky Scratcher to the private map pool"
	   ]
	},
	{
	   "version": "0.42.8",
	   "date": "April 1st, 2022",
	   "content": [
		  "<h3>EGG ORG have returned!</h3>",
		  "<p>Last year, EGG ORG HQ became Wreckage, as EGG ORG was blasted into space in their desire to crack Pablo once & for all. That should have been the end of it… Unfortunately, EGG ORG's top eggheads devised a desperate plan, diverting the spinning wreckage into a wormhole. However unlikely their plan was.. it worked. What was left of EGG ORG somehow ended up back on earth, 502 years in the past. Using their advanced evil bureaucracy, they created a foothold of power, affecting the future & once again threatening Shell Shockers & the very future of all Egg Kind. They have already started to take control of the present...</p>",
		  "<p>We have sent Pablo back in time, to finish EGG ORG before the takeover is complete. Can you help him find the code?</p>",
		  "EGG ORG have returned! Attacking medieval Eggtopia from the past!",
		  "Our last hope, we have sent Pablo back into the past to fight for all eggkind.",
		  "Chick'n Winner now offers extra large prizes! ",
		  "The premium EGG ORG Cannonball has blasted into the shop and free for all VIP members",
		  "Tweaks to Ruins, Kings Court, Enchanted and Field",
		  "Introducing Timetwist - The maze-like medieval EGG ORG Base",
		  "Timetwist and Wreckage added to the KotC game mode!",
		  "Moved Trainyard, Wreckage and Shellville to the public map pool",
		  "Moved Mud Gulch, Junction, and Shipyard to the private map pool"
	   ]
	},
	{
	   "version": "0.42.7",
	   "date": "March 15th, 2022",
	   "content": [
		  "It's March Madness and the Basketbros.io update! Choose your team skins in the shop!",
		  "Play Basket Bros today to unlock the eggsclusive Basketball Grenade!",
		  "Added the Premium Basket Bros Shotgun to the shop and free for all VIP members!",
		  "It's official - lower price Premium item are in the shop to stay!",
		  "Moved Sparta, Moonbase and Ruins to the public map pool",
		  "Moved Blender, Fort Flip, and Space Factory to the private map pool"
	   ]
	},
	{
	   "version": "0.42.6",
	   "date": "March 3rd, 2022",
	   "content": [
		  "Welcome to the We Stand with Ukraine update.",
		  "We have two special items in the shop, the Premium Ukraine Bandana, where all proceeds go towards the <a target='_blank' title='Save the Children’s Ukraine Crisis Relief Fund' href='https://support.savethechildren.org/site/Donation2?df_id=5751&mfc_pref=T&5751.donation=form1'>Save the Children’s Ukraine Crisis Relief Fund</a> and the Heart Ukraine stamp, that you can wear in-game to show your support.",
		  "Ukraine’s children are in grave danger of physical harm, severe emotional distress and mass displacement. Your purchase of the Ukraine Bandana is a donation to help provide children and families with immediate aid, such as food, water, hygiene kits, and psychosocial support."
	   ]
	},
	{
	   "version": "0.42.5",
	   "date": "March 1st, 2022",
	   "content": [
		  "Grab the luck of the Irish, St Patricks day skins now in store!",
		  "Added the Premium Lucky Clover Wings for all VIP members!",
		  "By popular demand, Kawaii Skins will remain in the shop",
		  "Vaulted Valentine's and a host of older skins",
		  "Tweaked maps: Cluckgrounds, Overcooked, Jailbreak, Catacombs and Mud Gulch",
		  "Adding 2 new duel maps, Eggcrates and Bridge to the Private map pool",
		  "Added Eggcrates and Jailbreak to the King of the Coop game mode!",
		  "Moved Catacombs, Jailbreak and Shellville to the public map pool",
		  "Moved Overcooked, Cluckgrounds, and Two Towers to the private map pool"
	   ]
	},
	{
	   "version": "0.42.4",
	   "date": "February 15th, 2022",
	   "content": [
		  "Nate's Nook skins - a collection based on <a target='_blank' title='game prototypes' href='https://bluewizard.com/nate/?utm_source=shellshockers&utm_medium=referral&utm_campaign=changelog'>game prototypes</a> by resident Wizard, Nate ",
		  "Added the Premium Retro RPEGG for all VIP members!",
		  "Introducing the Chick'n Winner! Play now for more eggs",
		  "Greatly improved mobile play by adding manual fire options",
		  "Vaulted Chilly skins",
		  "Added 3 new maps to the King of the Coop rotation!",
		  "Moved Sky Scratcher, Stage and Blue to the public map pool",
		  "Moved Trainyard, King's Court, and Bastion to the private map pool"
	   ]
	},
	{
	   "version": "0.42.3",
	   "date": "February 1st, 2022",
	   "content": [
		  "Kawaii! The cutest new skins ever are in the shop now! ",
		  "Added the Valentine's Day skin set for all of February",
		  "Added the Premium Octopus Grenade for all VIP members!",
		  "Vaulted Meggtrix skins",
		  "Added new map Enchanted to the public map pool",
		  "Added 3 new maps to the King of the Coop rotation!",
		  "Moved Castle, Feedlot and Palace Siege to the public map pool",
		  "Moved Dirt, Dirt 2, and Sparta to the private map pool"
	   ]
	},
	{
	   "version": "0.42.2",
	   "date": "January 17, 2022",
	   "content": [
		  "Twitch Drops Event hype! <a target='_blank' title='Sign up now!' href='https://shellshock.io/twitch'>Sign up now</a> to get items by watching shell!",
		  "Added the Chilly skin series to the store for one month only",
		  "Added 2x Premium items for VIP members - Supernova Grenade AND Pixel Rainbow Wings!",
		  "Fixed team balance and switching issues in King of the Coop",
		  "Map piece edits abound - Loading times are now faster!",
		  "Follow us on Twitch - click the link on the homepage footer to get a free skin!",
		  "Vaulted Eggsmas and New Year Skins",
		  "Added new map Scales to the public map pool",
		  "Added 4 new maps to the King of the Coop rotation!",
		  "Moved Junction, Mud Gulch and Blender to the public map pool",
		  "Moved Road, Moonbase, and Ruins to the private map pool"
	   ]
	},
	{
	   "version": "0.42.1a",
	   "date": "December 21, 2021",
	   "content": [
		  "Fixed outline color deviations in some team modes",
		  "Fixed errant King of the Coop zone on Bastion",
		  "Fixed scores not updating properly in Captula the Spatula"
	   ]
	},
	{
	   "version": "0.42.1",
	   "date": "December 15, 2021",
	   "content": [
		  "Happy New Yolk! 2022 items added!",
		  "VIP is now available for purchase on Mobile! ",
		  "Customise your controls on Shell Mobile! ",
		  "King of the Coop - Public lobbies now team balance between rounds",
		  "King of the Coop - Team swapping to losing team and winning awards bonus",
		  "Added Meggtrix skins for this month only! ",
		  "Become a VIP and get the Pixel Butterfly Wings",
		  "Degg the Halls - Eggsmas decorations added to the NEW public maps",
		  "King of the Coop - added more zone spawn points to Bastion",
		  "Added a few more Christmas skins under the tree (inventory)! ",
		  "Moved Helix, Dirt, and Catacombs to the private map pool",
		  "Moved Fort Flip, Trainyard and Shipyard to the public map pool"
	   ]
	},
	{
	   "version": "0.42.0a",
	   "date": "December 01, 2021",
	   "content": [
		  "NEW MODE: King of the Coop added! [WIP]",
		  "Tis the Season - Eggsmas skins added",
		  "Added King of the Coop skins",
		  "Added the Eggs of Legends skins for this month only",
		  "Become a VIP and get the Premium Retro Whipper",
		  "Deck the Halls - Eggsmas decorations added to all public maps",
		  "New map - King's Court added to public map pool",
		  "Map Helix revamped, more narrow spiral",
		  "Vaulted Halloween and Black Fryday skins",
		  "Moved Fort Flip, 4 quarters, Sky Scratcher, and Stage to the private map pool",
		  "Moved Feedlot, Bastion and Space Factory to the public map pool"
	   ]
	},
	{
	   "version": "0.41.1",
	   "date": "November 16th, 2021",
	   "content": [
		  "New VIP item - Thermal Wings now available!",
		  "Black Fryday approaches.. and we're hungry!",
		  "Edits made to Road - now has cars!",
		  "Halloween items vaulted",
		  "Halloween maps moved to private",
		  "Moved Trainyard, Jailbreak and Shellville to the private map pool",
		  "Helix, Sparta and Road moved to the public map pool"
	   ]
	},
	{
	   "version": "0.41.0",
	   "date": "November 1st, 2021",
	   "content": [
		  "Added the eggsclusive Thermal Detonator to the Egg Shack!",
		  "Added the Thanksgiving skin series for this month only. Delicious.",
		  "Implemented over 10 small Quality of Life bug fixes! ",
		  "Extended the Halloween set for 2 more weeks! ",
		  "Added new map Dirt Too into both map pools",
		  "Moved Overcooked, Sky Scratcher and Fort Flip to the public map pool",
		  "Moved Blue, Castle and Junction to the private map pool"
	   ]
	},
	{
	   "version": "0.40.9",
	   "date": "October 15th, 2021",
	   "content": [
		  "Sweet Treats! Moar Scary Stamps and Ghoulish Guns",
		  "Premium Moth Pixel Wings - Winged Doom for all VIP Players",
		  "Special edition Shell Game Stamps",
		  "Updates made to Jinx to create better pathing",
		  "Moved Dirt, Stage and Moonbase to the public map pool",
		  "Moved Sparta, Rameses, and Wreckage to the private map pool"
	   ]
	},
	{
	   "version": "0.40.8",
	   "date": "October 1st, 2021",
	   "content": [
		  "Introducing the Halloween Skin set for this month only!",
		  "Dare you try the howling new Halloween Map - Jinx?",
		  "Premium Retro Scrambler gifted to all VIP members",
		  "New Golden Beak stamp and updated VIP skins added for all VIP members!",
		  "Updates made to 4 Quarters to add more close range play!",
		  "Moved 4 Quarters, Jinx and Haunted to the public map pool",
		  "Moved Palace Siege, Helix, and Mud Gulch to the private map pool"
	   ]
	},
	{
	   "version": "0.40.7",
	   "date": "September 15th, 2021",
	   "content": [
		  "Introducing the hawt Premium Glitch Wings available to all VIP members",
		  "Added the winning Brothers skins to the store!",
		  "Wero Returns - Wear the Wero. Throw the Wero. Watch the Wero.",
		  "Map Stax Arena gets a minor upgrade",
		  "Moved Junction, Ruins and Trainyard to the public map pool",
		  "Moved Blender, Road, and Shipyard to the private map pool"
	   ]
	},
	{
	   "version": "0.40.6",
	   "date": "September 1st, 2021",
	   "content": [
		  "Introducing the A+ Skin set for this month only! ",
		  "Premium Glitterbomb Grenade gifted to all VIP members",
		  "Massive Map upgrade! Try New Jailbreak, Catacombs, Rameses, Space Arena, Bastion, AND Sparta!",
		  "Moved Jailbreak, Catacombs and Rameses to the public map pool",
		  "Moved Space Factory, Feedlot, and Overcooked to the private map pool"
	   ]
	},
	{
	   "version": "0.40.5",
	   "date": "August 15th, 2021",
	   "content": [
		  "Premium Pixel Fire Wings available to all VIP members",
		  "Added the eggciting ChantiGG Skins to the store!",
		  "Moved Cluckgrounds, Two Towers and Wreckage to the public map pool",
		  "Moved Sky Scratcher, Jailbreak, and Junction to the private map pool"
	   ]
	},
	{
	   "version": "0.40.4",
	   "date": "August 1st, 2021",
	   "content": [
		  "Premium Retro Free Ranger available to all VIP members",
		  "Rereleasing the out of this world Galeggsy skins for this month only",
		  "Follow us on Twitter to gain the Twitter Hat! ",
		  "Twisted! Added new map Helix to the public map pool",
		  "Moved Sparta, Mud Gulch and Shellville to the public map pool",
		  "Moved Dirt, Moonbase, and Fort Flip to the private map pool"
	   ]
	},
	{
	   "version": "0.40.3",
	   "date": "July 15th, 2021",
	   "content": [
		  "Wipe em off the map with the new Premium Item - TP Wings",
		  "Added the eggscellent Lyerpald pistol & stamp to the store!",
		  "Added the Blue Wizard Stamp to the store!  ",
		  "Moved Palace Siege, Shipyard and Road to the public map pool",
		  "Moved Stage, Ruins and Stax Arena to the private map pool"
	   ]
	},
	{
	   "version": "0.40.2",
	   "date": "July 1st, 2021",
	   "content": [
		  "Premium TP Grenade available to all VIP members",
		  "Introducing the Summer series of skins for this month only",
		  "Follow us on Facebook to gain the Facebook Hat! ",
		  "Added new Duel maps: Rivals and Stax Arena",
		  "Small edits to map Trainyard to allow for more movement",
		  "Moved Blender, Blue and Castle to the public map pool",
		  "Moved Catacombs, Trainyard, and Temple to the private map pool"
	   ]
	},
	{
	   "version": "0.40.1",
	   "date": "June 15th, 2021",
	   "content": [
		  "New Premium Item - Pixel Fairy Wings ",
		  "Added the eggscellent Ethan Gamer skin series to the store!",
		  "Moved Catacombs, Space Factory and Junction to the public map pool",
		  "Moved Wreckage, Two Towers and Cluckgrounds to the private map pool",
		  "Fixed small issues with Dirt & Jailbreak maps "
	   ]
	},
	{
	   "version": "0.40.0",
	   "date": "June 1st, 2021",
	   "content": [
		  "Shell Mobile released worldwide on iOS. <a target='_blank' title='Download now' href='http://onelink.to/6vfqw2'>Download Now</a> to get an exploding Cell Phone Grenade! ",
		  "Added the Premium Retro Crackshot to all VIP eggs and egg shack",
		  "Added the Merc Zone weapons to the store!",
		  "Click the homepage link to follow us on Steam & receive the Face Crab skin",
		  "New VIP button for easier access!",
		  "Added new map Junction to the private map pool",
		  "Moved Feedlot, Dirt and SkyScratcher to the public map pool",
		  "Moved Sparta, Mud Gulch, and Shellville to the private map pool",
		  "Removed stranded spatula spot from Stage map"
	   ]
	},
	{
	   "version": "0.39.8",
	   "date": "May 17th, 2021",
	   "content": [
		  "Trainyard reworked - Less long sightlines, slightly smaller, & 2x as good",
		  "Stage improved - Fixed see through blocks, expanded dancefloor! ",
		  "Added the RandomLife skin series to the store",
		  "Moved Trainyard, Stage and Moonbase to the public map pool",
		  "Moved Castle, Shipyard and Palace Siege to the private map pool",
		  "New loading bar! Get cracked in style!"
	   ]
	},
	{
	   "version": "0.39.7",
	   "date": "May 1st, 2021",
	   "content": [
		  "All Aboard! New Trainyard blocks added to the game ",
		  "Added the Trainyard skin series to the store",
		  "Added the Vehicle Weapon Pack to the store!",
		  "Vaulted the Easter skin series",
		  "Added new map Trainyard to the private map pool",
		  "New map rotations - Every update the public maps will change!",
		  "Moved Temple, Fort Flip and Jailbreak to the public map pool",
		  "Moved Road, Blender, and Blue to the private map pool"
	   ]
	},
	{
	   "version": "0.39.6",
	   "date": "April 15, 2021",
	   "content": [
		  "Joy! EGG ORG is defeated - The Wizards have returned",
		  "Rejoice! Pablo skins returned to inventory",
		  "EGG ORG HQ destroyed at their own hands",
		  "Disregard Diablo - Acquire Pablo",
		  "Moved Catacombs, Space Factory and Feedlot to the private map pool",
		  "Moved Overcooked, Ruins and added Wreckage to the public map pool"
	   ]
	},
	{
	   "version": "0.39.5c",
	   "date": "April 1, 2021",
	   "content": [
		  "EGG ORG has taken control",
		  "Added the premium Pixel Tri-Hard to the Egg Shack!  ",
		  "Added the eggsquisite EGG ORG stamps to the Shop!",
		  "Follow us! BWD TikTok link added to homepage",
		  "Disregard Pablo - Acquire Diablo ",
		  "Edited scoreboards - watch for favorite Content Creator",
		  "Added the Easter skin series for this month only",
		  "Vaulted the St Patricks Day series",
		  "Added the new map <strike>Trainyard</strike> EGG ORG HQ to the public map pool",
		  "Obliterated the map Ruins. It will not be missed.",
		  "Moved Dirt, Moonbase and Skyscratcher to the private map pool",
		  "Moved Two Towers, Mud Gulch and Shellville to the public map pool"
	   ]
	},
	{
	   "version": "0.39.4",
	   "date": "March 15, 2021",
	   "content": [
		  "Fancy Necromancy - Added the premium Skull Wings to the Egg Shack! ",
		  "Check it out - Added happy bouncing T-shirt Merch link!",
		  "Follow us! BWD TikTok link added to homepage",
		  "Mouth Stamps - Added a new stamp set to the store",
		  "Extra Hats - EarPods, Paperbag, Hipster, Beret, Spike",
		  "Small patches to maps: Dirt and Castle"
	   ]
	},
	{
	   "version": "0.39.3",
	   "date": "March 1, 2021",
	   "content": [
		  "Added the premium Skullnado to the Egg Shack! ",
		  "Homepage - Rotisserie added giving Shell Youtubers some limelight",
		  "Homepage - Added the Blue Wizard Digital discord hat offer",
		  "Added the St. Patricks Day skin series for this month only",
		  "Added the Pixel Stamp set to the Shop!",
		  "Vaulted the Groundhog series",
		  "Added new map Downfall to the private map pool",
		  "Moved Cluckgrounds, Sparta and Dirt to the public map pool",
		  "Moved Rameses, Jailbreak and Overcooked to the private map pool",
		  "Small updates to Dirt, Jailbreak, Overcooked, Rameses, Palace Siege, Space Factory, 4 Quarters, Castle Arena!"
	   ]
	},
	{
	   "version": "0.39.2",
	   "date": "Febuary 15, 2020",
	   "content": [
		  "Try hard with the new TriHard burst rifle!",
		  "Fixes to ammo synchronization",
		  "Action-queuing. Less button-mashing FTW!",
		  "Egg is now poseable in menus when moused-over",
		  "Free Ranger fire rate increased slightly, full reload slightly faster",
		  "EggK-47 accuracy increased, bloom and reload time decreased",
		  "Whipper clip size reduced to 40 rounds",
		  "Booted players now kept out of game with greater reliability",
		  "STREAMTASTIC: Added Hazmatt and C4bra skins to the store",
		  "HOLY S**T: New premium item, Pixel Angel Wings added"
	   ]
	},
	{
	   "version": "0.38",
	   "date": "n/a",
	   "content": [
		  "Added the premium Holy Hand Grenade to the VIP benefits! ",
		  "Added the eggsclusive Retro Cluck 9MM to the Egg Shack!",
		  "Removed the Techno RPEGG from the Egg Shack",
		  "Added the Groundhog Day skin series for this month only",
		  "Vaulted the New Year 2021 series",
		  "Added new map Sparta to the private map pool",
		  "Moved Rameses, Palace Siege and Shipyard to the public map pool",
		  "Moved Two Towers, Cluckgrounds and Fort Flip to the private map pool"
	   ]
	},
	{
	   "version": "0.37",
	   "date": "n/a",
	   "content": [
		  "Added the eggsclusive Techno RPEGG to the Egg Shack!",
		  "Removed the Steampunk Wings from the Egg Shack",
		  "Added the eggsquisite Thee_Owl Skins ",
		  "Introducing Grenade skins and effects - BOOM"
	   ]
	},
	{
	   "version": "0.36",
	   "date": "n/a",
	   "content": [
		  "Added the eggsclusive Steampunk wings to the Egg Shack!",
		  "Removed the Techno EggK-47 from the Egg Shack",
		  "Added the New Year 2021 skin series for this month only",
		  "Vaulted the Eggsmas series",
		  "Added new map Rameses to the private map pool",
		  "Moved Overcooked to the public map pool",
		  "Moved Mud Gulch to the private map pool"
	   ]
	},
	{
	   "version": "0.35",
	   "date": "n/a",
	   "content": [
		  "Added the eggsclusive Techno Eggk-47 to the Egg Shack! ",
		  "Added the muy caliente Wero Hats and Stamp to the Shell store",
		  "Removed the Chrome Wings to the Egg Shack"
	   ]
	},
	{
	   "version": "0.34",
	   "date": "n/a",
	   "content": [
		  "Tweaks to The most Fantabulous VIP club!",
		  "Added the eggsclusive Chrome Wings to the Egg Shack!",
		  "Removed the Techno Free Ranger from the Egg Shack",
		  "Added the Eggsmas skin series for this month only",
		  "Vaulted the Thanksgiving skin series",
		  "Added new map Overcooked to the private map pool",
		  "Updated maps Dirt Arena & Blender",
		  "Moved Catacombs, Blue & Blender to the public map pool",
		  "Moved Haunted & Dirt to the private map pool"
	   ]
	},
	{
	   "version": "0.33",
	   "date": "n/a",
	   "content": [
		  "Announcing the The Most Fantabulous VIP update!",
		  "VIP Golden Wings!",
		  "Eggclusive items as they come out!",
		  "x2 Eggs - ALL THE TIME",
		  "More EggShell Colors",
		  "NO MORE ADS! ",
		  "All for less than $5 USD / month"
	   ]
	},
	{
	   "version": "0.322",
	   "date": "n/a",
	   "content": [
		  "Preparing for something new..."
	   ]
	},
	{
	   "version": "0.32",
	   "date": "n/a",
	   "content": [
		  "Introduced the Premium Catz Free Ranger - The Purrfect weapon",
		  "Vaulted the Halloween items",
		  "Removed the Fallen Wings from the Egg Shack"
	   ]
	},
	{
	   "version": "0.31",
	   "date": "n/a",
	   "content": [
		  "Added the eggsclusive Fallen Wings to the Egg Shack!",
		  "Removed the BADOOSH scrambler from the Egg Shack",
		  "Added the Thanksgiving series for this month only",
		  "Vaulted the Halloween Skin series",
		  "Added new map Catacombs to the private map pool",
		  "Moved Jailbreak to the public map pool",
		  "Moved Shellville to the private map pool"
	   ]
	},
	{
	   "version": "0.30",
	   "date": "n/a",
	   "content": [
		  "Added the BADOOSH Scrambler to the Egg Shack!",
		  "Removed the Demon Wings from the Egg Shack"
	   ]
	},
	{
	   "version": "0.29",
	   "date": "n/a",
	   "content": [
		  "Tweaked vertices wizardry means an average of 5 FPS eggstra!",
		  "Added the Limited Edition Demon Wings to the Egg Shack!",
		  "Added the Halloween skin series for this month only",
		  "Launched the Stampede! event with over 20 stamps added",
		  "Includes contest stamps from: Thee_Owl, Waldoh?, Egginator, Don Huevo and Jasper",
		  "Vaulted the Chicken skin series",
		  "Added new map Haunted directly to the public map pool",
		  "Moved Jailbreak to the private map pool"
	   ]
	},
	{
	   "version": "0.28.6",
	   "date": "n/a",
	   "content": [
		  "Updates to new map lighting and shaders"
	   ]
	},
	{
	   "version": "0.28.5",
	   "date": "n/a",
	   "content": [
		  "New Lighting System Implemented! Better colours / Better Shadows",
		  "Improved unseen verticies - You may notice an FPS increase!",
		  "Fixed some issues with simultanious code redemtion. ",
		  "Included new <a target='_blank' title='Get the Friday the 13th puzzle game here.' href='http://www.f13killerpuzzle.com/xboxone'>Friday the 13th: Killer Puzzle</a> Stamp"
	   ]
	},
	{
	   "version": "0.28.4",
	   "date": "n/a",
	   "content": [
		  "New Premium item added - The Epic Rooster Wings!",
		  "Pop-pop Premium item vaulted",
		  "Spawn points on Stage improved",
		  "Added the Chicken Skin series for this month only",
		  "Vaulted the Gallegsy skin series",
		  "Added new map Blender to the private map pool",
		  "Moved Feedlot and Road to the public map pool",
		  "Moved Stage and Blue to the private map pool"
	   ]
	},
	{
	   "version": "0.28.3",
	   "date": "n/a",
	   "content": [
		  "New Premium item added - Pop-Pop 9mm. POP!",
		  "Gallegsy Wings Premium item vaulted",
		  "Mud Gulch subtley improved. Can you find it?"
	   ]
	},
	{
	   "version": "0.28.2",
	   "date": "n/a",
	   "content": [
		  "New audio engine that will actually work on your terrible laptop!",
		  "Added an Eggsclusive hat to the Egg Shack!",
		  "Added the Galleggsy Skin series for this month only",
		  "Vaulted the Rockstar Skin series",
		  "Added new map Four Quarters to the private map pool",
		  "Edits made to Bastion to improve player flow",
		  "Moved Two Towers and Stage to the public map pool",
		  "Moved Dirt and Road to the private map pool"
	   ]
	},
	{
	   "version": "0.28.1",
	   "date": "n/a",
	   "content": [
		  "Added KILLSTREAKS! Get 5 Kills to earn the Hardboiled armor powerup! Get 10 kills to earn the Eggbreaker damage multiplier!",
		  "Added NEW PREMIUM ITEMS! Check the Store for 8 new ultra-rare hats and skins!"
	   ]
	},
	{
	   "version": "0.27.82",
	   "date": "n/a",
	   "content": [
		  "Poki stuff"
	   ]
	},
	{
	   "version": "0.27.81",
	   "date": "n/a",
	   "content": [
		  "Added an Eggslusive weapon to the Egg Shack!",
		  "Can you feel the music? New Droppin' Mad Beaks event",
		  "Added the Rockstar Skin series for this month only",
		  "Added Map Stage to the private map pool",
		  "Updated Map Space Factory - now even rampierer",
		  "Moved Castle and Space Factory to the public map pool",
		  "Moved Two Towers and Feedlot to the private map pool"
	   ]
	},
	{
	   "version": "0.27.8",
	   "date": "n/a",
	   "content": [
		  "Added an Eggslusive weapon to the Egg Shack!",
		  "Can you feel the music? New Droppin' Mad Beaks event",
		  "Added the Rockstar Skin series for this month only",
		  "Added Map Stage to the private map pool",
		  "Updated Map Space Factory - now even rampierer",
		  "Moved Castle and Space Factory to the public map pool",
		  "Moved Two Towers and Feedlot to the private map pool"
	   ]
	},
	{
	   "version": "0.27.7",
	   "date": "n/a",
	   "content": [
		  "Add new egg store sale notification"
	   ]
	},
	{
	   "version": "0.27.6",
	   "date": "n/a",
	   "content": [
		  "Add new popup for sale items"
	   ]
	},
	{
	   "version": "0.27.5",
	   "date": "n/a",
	   "content": [
		  "Added the Rotten Skin series for this month only",
		  "Added Map Temple to the private map pool",
		  "Added the Scorched Horizon Mask to the shop",
		  "Moved Fort Flip and Moonbase to the public map pool",
		  "Moved Castle and Palace Siege to the private map pool"
	   ]
	},
	{
	   "version": "0.27.4",
	   "date": "n/a",
	   "content": [
		  "New setting: Safe Names - Randomizes all player names"
	   ]
	},
	{
	   "version": "0.27.3",
	   "date": "n/a",
	   "content": [
		  "Added the Amazing Raid.Land Skins",
		  "Added Bastion Map to the private Map Pool",
		  "Fixed Ladder Glitches on Jailbreak",
		  "Vaulted Easter Items",
		  "Moved Moonbase to the private map pool",
		  "Moved Skyscratcher to the public map pool!"
	   ]
	},
	{
	   "version": "0.27.2",
	   "date": "n/a",
	   "content": [
		  "The Blue Wizards have escaped! ",
		  "EGG ORG is gone... for now. It will take time to return things to normal",
		  "STAY INSIDE - Edited Map Biohazard to remove bugs",
		  "New map Jailbreak added to Private games",
		  "Vaulted Evil EGG ORG Stamp"
	   ]
	},
	{
	   "version": "0.27.1",
	   "date": "n/a",
	   "content": [
		  "All Hail our Glorious Corporate Overlords, EGG ORG! - stamp now in store.",
		  "STAY INSIDE - Added Map Biohazard to the private map pool",
		  "WASH HANDS - Added Face Masks to the store",
		  "Vaulted Saint Patricks Day skins",
		  "Added Easter skins and cosmetics "
	   ]
	},
	{
	   "version": "0.27.0",
	   "date": "n/a",
	   "content": [
		  "Added Gamepad Support! You can now find extra options in the setting menu",
		  "A whole host of bug fixes!",
		  "Fixes to Castle Map"
	   ]
	},
	{
	   "version": "0.26.4",
	   "date": "n/a",
	   "content": [
		  "Added Quick-Switch weapon select on respawn menu - Noice",
		  "Your favorite Chicken Nugget has had a makeover",
		  "Added Map 'Sky Scratcher' to the private map pool",
		  "Vaulted Valentine's Day Skins",
		  "Added Saint Patrick's Day skins - Too Ra Loo!",
		  "Updated 'Space Factory' map with better bullet collision",
		  "Minor 'Road' map updates"
	   ]
	},
	{
	   "version": "0.26.3",
	   "date": "n/a",
	   "content": [
		  "Every weekend in February is a DOUBLE XP weekend!",
		  "Changes to Mud Gulch and Space Arena, now at least 1.4 times as fun",
		  "Moved Fort Flip to Private and Mud Gulch to public",
		  "Added Map Space Factory to the private map pool",
		  "Added Hyper Eggspensive Egg in Black skins",
		  "Added Valentines Skins for the month of February",
		  "Added enhanced 2X Egg functionality and UI elements",
		  "New Years Eve skins have been vaulted",
		  " Extra Language support added for non-English Players"
	   ]
	},
	{
	   "version": "0.26.2",
	   "date": "n/a",
	   "content": [
		  "Christmas and Eggwalker skins have been vaulted",
		  "New Years and Nuke Zone skins have been added to the store",
		  "New map Mud Gulch added to the private map pool",
		  "Cluckgrounds updated AND moved to the Public Map Pool",
		  "By popular demand, Ruins has been added back to the Public Map Pool"
	   ]
	},
	{
	   "version": "0.26.1",
	   "date": "n/a",
	   "content": [
		  "New functionallity added for Double Egg Weekend",
		  "Get Yolked this weekend with DOUBLE THE EGGS (Golden Nugget = 4X eggs this weekend)",
		  "Map Cluckgrounds updated with a more open downstairs"
	   ]
	},
	{
	   "version": "0.26.0",
	   "date": "n/a",
	   "content": [
		  "Christmas and Eggwalker skins are available in the store",
		  "New map Cluckgrounds added to the private map pool",
		  "Palace Siege moved to the Public Map Pool",
		  "Enhanced backend bugfixes",
		  "Return of the nugget"
	   ]
	},
	{
	   "version": "0.25.7",
	   "date": "n/a",
	   "content": [
		  "A host of more unexciting bug fixes and security patches. ",
		  "Improved SEO functions on the main page and other things you probably don't care about. Read it now by scrolling down... umm... after the changelog is closed."
	   ]
	},
	{
	   "version": "0.25.6",
	   "date": "n/a",
	   "content": [
		  "A host of unexciting bug fixes and security patches. ",
		  "The Chicken Nugget is back from holiday and once again, doubling eggs for an hour"
	   ]
	},
	{
	   "version": "0.25.5",
	   "date": "n/a",
	   "content": [
		  "New default weapons - look better, sound better, plays the same!",
		  "Vaulted the Guy Fawkes Mask",
		  "Small map balance tweaks to Moon Arena and Road",
		  "Spatula added to Palace Siege",
		  "General Bug Fixes"
	   ]
	},
	{
	   "version": "0.25.4",
	   "date": "n/a",
	   "content": [
		  "Happy Thanksgiving! Enjoy some turkey with your eggs with a bunch of festive skins.",
		  "Vaulted the Halloween items.",
		  "Added Map: Dual Pyramid to the private map pool.",
		  "Added Map: Palace Siege to the private map pool.",
		  "Road has been moved to a public map, look for it in the regular rotation.",
		  "Ruins has been moved to a private only map."
	   ]
	},
	{
	   "version": "0.25.3",
	   "date": "n/a",
	   "content": [
		  "Some refinements to the new collision detection to prevent some strange things that you probably thought where fun. TOO BAD.",
		  "Patched up a few holes in the maps, because some of those were fun, too."
	   ]
	},
	{
	   "version": "0.25.2",
	   "date": "n/a",
	   "content": [
		  "Halloween items are back for you and your BOO... Sorry.",
		  "FIX grenades sometimes flying off in random directions.",
		  "FIX cases where weapons would occasionally become completely ineffective.",
		  "FIX certain instances where some shots would fail to register."
	   ]
	},
	{
	   "version": "0.25.1",
	   "date": "n/a",
	   "content": [
		  "Updates to the 1v1 Metadata",
		  "Make the Egg Clickable on the Title Screen",
		  "General minor bug fixes and Optimizations"
	   ]
	},
	{
	   "version": "0.24.1",
	   "date": "n/a",
	   "content": [
		  "Updates to the new 1v1 Maps -- more hidey hidey.",
		  "Fixed a bug where redeeming a code currently does not populate in inventory until you refresh.",
		  "Fixed a bug where people's names were getting capitalized on the Kill/Death message.",
		  "Added a sign in button to anonymouse warning popup."
	   ]
	},
	{
	   "version": "0.23.3a",
	   "date": "n/a",
	   "content": [
		  "Check out our fresh new look!",
		  "New 'Memphis' weapon skins available in the shop!",
		  "Celebrate ShellShockers' 2nd birthday with some new hats and decals!",
		  "New 1v1 / Competitive Maps!",
		  "Fix for some weapon reloading/ammo pickup problems",
		  "Fix for some issues caused by spam-jumping",
		  "Fix for volume settings not being honored",
		  "Fix for a number of chat issues",
		  "Sanity checks for mouse movement to help mitigate spikes on some systems"
	   ]
	},
	{
	   "version": "0.21.4",
	   "date": "n/a",
	   "content": [
		  "Games no longer crash when a booted player attempts to rejoin",
		  "An attempted fix for some jumping and shooting inconsistencies"
	   ]
	},
	{
	   "version": "0.21.3",
	   "date": "n/a",
	   "content": [
		  "At long last, SPECTATOR MODE, available from the in-game menu. Make sure to check out the Settings menu for exclusive spec mode control options."
	   ]
	},
	{
	   "version": "0.21.2",
	   "date": "n/a",
	   "content": [
		  "Fixed some bugs pertaining to jumping, which just created some new ones. Yay!",
		  "Fixed problems with the Auto Detail checkbox in the Settings menu",
		  "July 4th stamp! And uhhh... yeah, that's it",
		  "A bunch of server-side stuff that's nice for me, but you won't care about"
	   ]
	},
	{
	   "version": "0.21.1",
	   "date": "n/a",
	   "content": [
		  "Dramatically-improved movement synchronization. MUCH ACCURACY. VERY SMOOTHNESS.",
		  "Projectile latency compensation (up to 500ms). It's almost like a real FPS. Almost.",
		  "Fixed some wonky rotation sync issues that were causing stray bullets and grenades.",
		  "Tracer rounds. EggK-47: Every other bullet is visible. SMEGG: Every third.",
		  "More performant shell fragment effects for non-fatal hits, along with new yolk splats!",
		  "You noticed this already, but you can now see the whole changelog... yeah.",
		  "Fixed that dumb RPEGG animation again.",
		  "Fixed that dumb flickering weapon-swapping animation, too.",
		  "Some substantial server performance enhancements."
	   ]
	},
	{
	   "version": "0.20.2a",
	   "date": "n/a",
	   "content": [
		  "AVEGGERS, ASSEMBLE!"
	   ]
	},
	{
	   "version": "0.20.2",
	   "date": "n/a",
	   "content": [
		  "CSG1 clip and ammo storage capacity increased. Bloom decreased just a smidge",
		  "Fixed a clipping issue with gold SMEGG skin"
	   ]
	},
	{
	   "version": "0.20.1",
	   "date": "n/a",
	   "content": [
		  "<h3>NEW WEAPONS:</h3>",
		  "M2DZ bolt-action rifle.",
		  "SMEGG submachine gun.",
		  "<h3>CHANGES TO OLD WEAPONS</h3>",
		  "EggK-47: 600RPM[+] / 30DMG[-] / Bloom decreased",
		  "Dozen Gauge: 170DMG[-] / Stability, accuracy, and range increased",
		  "RPEGG: 140DMG[-] / Blast radius 2.75[-]",
		  "CSG1: 120RPM[+] / 102DMG[-] / Accuracy <i>very slightly</i> decreased",
		  "Cluck 9mm: 450RPM[-] / 26DMG[+] / Bloom decreased",
		  "Bullet velocity increased a bit across the board",
		  "<h3>ALSO</h3>",
		  "Fix for Castle jump exploit",
		  "Hitting very edge of shell now does at least 10% weapon damage instead of zero"
	   ]
	},
	{
	   "version": "0.20.0",
	   "date": "n/a",
	   "content": [
		  "<h3>NEW WEAPONS:</h3>",
		  "M2DZ bolt-action rifle.",
		  "SMEGG submachine gun.",
		  "<h3>CHANGES TO OLD WEAPONS</h3>",
		  "EggK-47: 600RPM[+] / 30DMG[-] / Bloom decreased",
		  "Dozen Gauge: 170DMG[-] / Stability, accuracy, and range increased",
		  "RPEGG: 140DMG[-] / Blast radius 2.75[-]",
		  "CSG1: 120RPM[+] / 102DMG[-] / Accuracy <i>very slightly</i> decreased",
		  "Cluck 9mm: 450RPM[-] / 26DMG[+] / Bloom decreased",
		  "Bullet velocity increased a bit across the board"
	   ]
	},
	{
	   "version": "0.18.2",
	   "date": "n/a",
	   "content": [
		  "The spatula can no longer boldy go where no egg has gone before (or will)",
		  "Major improvements in sound reliability for all you poor souls with Chromebooks and other puny laptops that get sad when asked to do stuff like... I dunno... PLAY SOUNDS?"
	   ]
	},
	{
	   "version": "0.18.1",
	   "date": "n/a",
	   "content": [
		  "New CAPTULA THE SPATULA game mode is now available! GET SOME.",
		  "Boot player function wasn't working quite right. Now it is.",
		  "Multi-domain support, in case you get blocked."
	   ]
	},
	{
	   "version": "0.17.1",
	   "date": "n/a",
	   "content": [
		  "Valentine's Day items are now available! Love, Shell Shockers.",
		  "RPEGG firing delay removed. Rockets now have a minimum arming range, indicated by the red/green brackets.",
		  "Icons added to leaderboard to indicate golden eggs/nuggets and mute status.",
		  "Oh, and a cool new map. Whatever."
	   ]
	},
	{
	   "version": "0.17.0",
	   "date": "n/a",
	   "content": [
		  "Massive ordinance collision detection overhaul",
		  "A lot more work on grenade dynamics",
		  "Changes to grenade and rocket blast radius and damage",
		  "Updates to some particle effects"
	   ]
	},
	{
	   "version": "0.16.0",
	   "date": "n/a",
	   "content": [
		  "Groundhog Day items! Get them before they see their shadows!",
		  "Private game creators can now boot naughty players.",
		  "You can now mute other players. Their chat will no longer show, and their name will be changed to a random one.",
		  "Black egg shell color had to go. It is now bright green, so you can see those cracks!"
	   ]
	},
	{
	   "version": "0.15.9",
	   "date": "n/a",
	   "content": [
		  "Grenade physics got a major, much-needed overhaul."
	   ]
	},
	{
	   "version": "0.15.8",
	   "date": "n/a",
	   "content": [
		  "Old, cruddy, stale public games are now locked after 2 hours to keep map rotation fresh.",
		  "Team player count balance now enforced once again in public games only.",
		  "Fixes to the Auto Detail option in the Settings menu.",
		  "Did a bunch of boring server stuff to help mitigate lag spikes... at least, the ones that <i>aren't</i> caused by your lousy WiFi.",
		  "Fixed some weapon-switching problems for you people who can't be bothered to wait 2 measly seconds before jumping into the Equipment screen and changing everything."
	   ]
	},
	{
	   "version": "0.15.7",
	   "date": "n/a",
	   "content": [
		  "New settings menu that won't show up blank, offers an option to reset to defaults, and allows you to assign mouse wheel up/down actions.",
		  "New health bar. Much compact and fancy!"
	   ]
	},
	{
	   "version": "0.15.6",
	   "date": "n/a",
	   "content": [
		  "Christmas is so yesterday; Happy New Yolk! New skins are available.",
		  "I know we're a friendly bunch, but nobody likes spawning on top of their teammates, so that shouldn't happen now.",
		  "Servers were having a hard time keeping up with new game requests, leaving a lot of people with 'Matchmaker Offline' messages. I thought that was dumb, so server-side game creation speed has been improved DRAMATICALLY."
	   ]
	},
	{
	   "version": "0.15.5",
	   "date": "n/a",
	   "content": [
		  "Golden Nugget! It's like a Golden Chicken, but kinda not!",
		  "Better, more diverse spawn points",
		  "Improved inter-server communication"
	   ]
	},
	{
	   "version": "0.15.4d",
	   "date": "n/a",
	   "content": [
		  "Golden Chicken Pass! More shell colors! No ads! Buy now!",
		  "New, improved egg death animation. GADZOOKS; THERE'S YOLK EVERYWHERE!"
	   ]
	},
	{
	   "version": "0.15.3",
	   "date": "n/a",
	   "content": [
		  "RPEGG now requires players to stop and get settled before firing. No more rushing people and blowing yourselves up, losers!",
		  "Very slight tweaks to other weapons that I'm not going to tell you about. I'm already regretting just typing this.",
		  "Live Twitch streamer list. WE WILL BE WATCHING."
	   ]
	},
	{
	   "version": "0.15.2",
	   "date": "n/a",
	   "content": [
		  "GOBBLE, GOBBLE, TURKEY... something. Turkey Day skins are here!",
		  "Worked on some server stability nonsense... BOOOORING.",
		  "Before you ask, yes, the RPEGG will be getting some tweaks. Next time!"
	   ]
	},
	{
	   "version": "0.15.1",
	   "date": "n/a",
	   "content": [
		  "Brand new EGGSPLODER class, weilding the mighty RPEGG! Yeah, it's a new gun; don't have a heart-attack. Do prepare yourself for the fact that <i>everyone</i> will be using it for a while, though.",
		  "Fixed an issue where new games couldn't be created on a server after a while. If you see a message complaining about the match-maker, just give it a moment and try again.",
		  "Fixed an issue where you could only enter 2 lines of smack in chat while dead."
	   ]
	},
	{
	   "version": "0.14.7",
	   "date": "n/a",
	   "content": [
		  "<h3>Fixes for all of the following annoying stuff:</h3>",
		  "Invincibile players",
		  "Indivisible players",
		  "Inadmissible players",
		  "Inadvisable players",
		  "Inconceivable players",
		  "Incomprehensible players",
		  "Just kidding about all but the first one; especially the last one.",
		  "Probably fixed some other things in the process. It was that bad."
	   ]
	},
	{
	   "version": "0.14.6",
	   "date": "n/a",
	   "content": [
		  "<h3>What's New</h3>",
		  "New scare-your-pants-off Halloween items!",
		  "<h3>Bug Fixes</h3>",
		  "Some server stability issues"
	   ]
	}
 ]